#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b9b73ec6-6f28-41bb-8e11-6aef62bf9322]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d8fca9c8-9be0-4467-ae02-d8722543d508]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=07617684-e189-4448-b8a5-b4beba0b9b06]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=da23c480-d871-4c59-8a47-b4293a54337e]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=df829a6b-52fd-4409-a61e-cbedf081a052]
module.keycloak_dev.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6f98e5c9-fbd2-40f8-91c5-3ba2a4c12802]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73347af8-9d7f-41c6-b41b-57a19bcdd922]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fc927d9-9245-4aa1-98ef-441e07cb05ef]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=027a0e5a-ec26-4d4b-a7c1-38c74d3927f4]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4036e5b-1106-4ac4-9830-cba8c1b748a7]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a3fbe3-f8de-4d37-a66c-792e6ee66f87]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9c47eb8e-e8cc-4fe5-ad64-cf9a9f4eb7ad]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8eaf3833-1600-4c88-add9-733a8db25320]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9233062d-7b5d-4bc8-847d-99dcd6d7dac6]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29935c7c-1439-4665-9d86-02672a8d71ad]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=465edd6a-aaa8-4c49-a042-53a56798f582]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=324970c7-bdb6-4f3e-8f8d-797e7d010ac7]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b54e506f-f9ec-4168-8c28-5f0b19c4ecd0]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2fa4c6a4-df79-4d65-990b-6ad664f88e84]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6317c2ef-91bd-46a1-963a-0a7afdeaf7c9]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cc148327-319c-475c-a943-8a313bc7f828]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2dc6e22c-402c-4789-a572-9a26cc2a693a]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5f0ac9d-5d82-4162-9291-7b504da9f90b]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0c4cf74f-bd9d-4132-9aad-61386c6a6276]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_openid_client.this: Refreshing state... [id=934c9beb-0886-4f5d-a0bd-4482c0bdcd9d]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=27bb0ecd-8865-476d-a5d5-49b318862d17]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3e8f1e74-984b-4267-8b0f-8b22469fd055]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_openid_client.this: Refreshing state... [id=8b181a41-062d-4e4f-89a0-a5f63b85e2fa]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_openid_client.this: Refreshing state... [id=ae380485-b943-4845-898e-c440ff2aa931]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_openid_client.this: Refreshing state... [id=4af6a9ee-713b-413f-8d23-e2669e8af262]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_openid_client.this: Refreshing state... [id=96e941f3-b8c5-42f7-877f-266ca2359d54]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=602df616-9e86-41a7-8877-fe684ecabff1]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_openid_client.this: Refreshing state... [id=c20b51f3-372d-438c-96be-3113d3a24e10]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_openid_client.this: Refreshing state... [id=cc6214d8-1a48-4e2f-9fd4-8fa0c690983d]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=e326e182-06ba-4007-b111-a34a369001ba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=0c62f2ce-c27e-4173-b692-57789a7a9bc7]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47adddae-1f15-494f-a779-2aa73d2fa5e1]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5464af2a-dee3-41a6-816d-021bf5947753]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d8b346b-2428-416c-8a93-46d81fe1624a]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=934f5472-219a-417d-8ec5-8aa7bf64c206]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c3f08da7-36c2-4514-b0d9-624cc4ba7e65]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa54bd66-7db0-4edf-aef5-d59c1be7c01a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5dcccb6-11fc-4959-891f-eb913d465e90]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a784fbba-d62c-4d46-922d-6ed7e7a46f5f]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0946a9f6-b418-434c-979c-a03b865a3597]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02a3db30-2c0e-45e1-965e-bd2f527c30d2]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28494fbf-480a-4bbf-bc13-576e074c197d]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d1ab7822-ae59-4b13-bec4-b507bd5dd51a]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3571b37c-1181-43d9-b37e-01fbafd92421]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bdb011bf-561b-48bb-bda4-dd568280e31f]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a3e3d19-036a-4abd-9b2c-ee1e5094bb51]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d7aa8d1-63d1-436b-a556-bfb2702ebbc2]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_openid_client.this: Refreshing state... [id=ef5d0e0d-a776-4b65-8b8c-2dceb8314030]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_openid_client.this: Refreshing state... [id=1d711840-f173-4492-a97a-739b5de24ec7]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=918ad7a6-4d1e-494e-a594-ebf6b3790a16]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_openid_client.this: Refreshing state... [id=f534138d-1ce9-4ade-b7c5-edf1678b9783]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ef30d3ad-5550-4098-9359-9908c0620b62]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ab394989-a8f2-425c-a1e2-2fac53eccb32]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=b99e92e1-b511-48d0-a667-dec8baa567b8]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a58e4fd-a992-455a-a7fc-34d476249dd3]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_openid_client.this: Refreshing state... [id=aa35f373-b326-4e37-bd3a-7f295e9ae7df]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_openid_client.this: Refreshing state... [id=958f0a0d-0984-4957-9dca-d020a6a1dd91]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_openid_client.this: Refreshing state... [id=eda9def9-cb65-4bbe-b155-016a4e0efc7b]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=61f7d821-3022-45a1-aa7d-1217862083eb]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ad40f772-1525-48d4-8fdd-d2e435a961cb]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20dbda9c-02a0-4fa0-9a83-82ee21f82f67]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7e3e3945-86e4-48e0-8c60-c9536073e55e]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3923b999-947e-4eed-b38f-4e1ad4866b73]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=e1ad3b73-8922-4609-bf1f-75646cfaa7f4]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=802f1d36-b108-4397-a8ec-c21e59dd7cae]
module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7b133bec-a2f6-4b1b-a2e5-6267ac081c7b]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63c3de9-dad6-4441-9614-93176ff61d97]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af4c3876-a275-4eeb-963f-73c505e2923e]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ef6ef143-6ed3-4f32-bc6a-27779bcd9f0b]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b32d38f-0fa1-444d-9758-c983f4b34fd0]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_openid_client.this: Refreshing state... [id=6d35e02f-fd17-4e73-9c3c-d5fb96599ec0]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=417d247a-5183-4a95-ac72-180fa91bde9b]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e689aa1-a2ce-4c30-b366-7e79238036a3]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b39ea164-2a54-487a-9e70-e24bb8725b05]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d7e50097-5bff-4e3e-b239-f1145d6e5753]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b955a72-4cb1-4e12-b22b-d4e669dd18b9]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccee6b0d-a27d-45c7-afad-c4dfd345e614]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=47288847-b2d5-4398-8491-7e80aa875e90]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=282987c8-188f-47e5-9791-f9839fc166ab]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=69643de7-f9e4-4c46-8546-73c3b82ec494]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c13e6019-bbf4-4f12-a7bd-60c3a21b1977]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce7f27cf-d633-4652-a78a-3d30c90b5db2]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=789ba9c5-cd38-4cf5-b975-87dad66bb265]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c97a113e-75ac-4105-a006-9ff0eb217b0d]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ca3a3a5e-12a6-476f-958d-ea7275f23ed1]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4dac9412-e733-45c4-83b9-5656398dd729]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e5219c7-b715-41b2-a0f3-08b93de637cf]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=dd3584fd-5180-4c3a-81a2-ae7097d931b9]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=153d5614-3ea8-4313-beb3-0abaa48d82c0]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=12d6a292-7d42-42f9-8e4c-7ca0bac367fc]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b033767f-c3f0-4cc7-8a3a-358d280c4904]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd5ed191-1023-443d-a5ce-9e8d4cc4cb6c]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=085b8be1-5041-4081-a3aa-d1a3c334a7f5]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0ece09ee-4846-40d9-8aae-b167b198baf4]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4df5b321-c4b5-4cb5-961b-3b01d71470f1]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=36cb7271-c10c-46e0-9377-1a19334fe91a]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=32e4d193-e002-466b-9494-9fc499be1ddd]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6bd54c02-2628-489d-aa5c-3d027abb45da]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d5f9440-3e5f-49b8-a1bb-8a5229dccc16]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=24194681-e44b-4bb4-890e-f52025105f67]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=036873cc-1079-4bcc-8d80-28fa3eae032e]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=45a39473-6159-4c27-92a7-d08decd568fa]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0dd0e9a1-17a5-4289-9e6b-b7bcf38a831e]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=860ffa2a-9957-4405-ac65-412dfd6e54b6]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=65bcfaa7-42a9-48e3-9b11-e62b3d34c1e1]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f281ceb3-d891-4acb-8688-f54894641132]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3b653bf7-d7d4-41d3-bf90-57103dbb1f2a]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=579d3bf6-2719-492c-8808-aa54e5b0be16]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6e98bf3-929b-450b-a98f-82cd47b03fba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c6eaa078-6965-4f29-85c4-28a4e7f9ae27]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7009c9cc-54d1-45b9-bc67-a3d25cf42dd5]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eab68a5f-0f4e-4654-bcb6-7220ffdd74ee]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=29c4eb8c-6ac2-425c-8c9d-fd8b16e5f4ba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80405ebd-d65b-468e-9d1a-a34ac95b141f]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f5f8aced-9b81-4ec4-92c8-7bcecc81173b]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b5da28e3-5058-4f67-b8bc-9eb1069c3b70]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=da463c3a-7fc4-4e5f-90d6-e03a4946da02]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89e313ab-659f-46c1-b704-353f46538c79]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e7ffaa1e-58a8-4436-9e0b-0abd0ad5e4cc]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9756b434-edb2-4832-ae66-9ae6ff151813]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2cbcd95a-59a1-4ec0-a026-7e6696f73065]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=95a7435e-5034-4492-aebc-dcc4ee41a770]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a87bd1e-672c-4951-87a4-0fe8ba39874a]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f107c290-9760-4f9f-864d-5d136feb4c68]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0518c07f-9ead-4916-824c-659f1308faaa]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=49a7b096-a394-4977-871c-f82ed3e18bc5]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3e811139-c682-4c20-ae3f-e49a7ad2a858]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3546f442-c3a5-47b6-955d-c6237753da67]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=42b95a57-a30c-4f84-a105-314b1e4596c4]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0d6eafb5-48fe-4ccf-ae03-e4bd74958dd2]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d1a8a9cb-6b99-4a85-bb92-fe72bd201a4a]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=648884f9-6c6e-4c1f-8c92-156560e7cb49]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5eeaded1-a96a-4a38-a826-d84f1c5c9210]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d11cb4ad-87e7-4695-90bf-96993f9ee3f6]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a0c526ee-ad85-40b2-b55f-f3c1fec76376]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e0bdcd5a-5d9e-4a09-aa15-26398a69f91e]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0f5563b-6697-4ac8-b35d-fd79b3528e28]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b15c5c8e-c382-478c-9379-d57e77624cf1]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5eac6ffe-edd5-4b0f-887f-f3961dd7b309]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d2fbe100-8bec-4b02-a900-f92042513ac3]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6c1c5a7-9c27-4c87-8e5e-516fdc06628e]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9bb0cba-9618-4047-965d-ed18f14a782e]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=458db92f-9bcf-4719-a3d7-1b3d02c0fbc5]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9cdc2c58-be72-401c-89bd-6d066e6c5ae9]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3d25a5b8-9836-4b23-9366-2a7905eb826c]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4e5fbf91-f869-4c32-ae04-01c0014fa99c]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=86d6bd6c-b64f-4bc4-ab32-fe4a218edf1f]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f940b209-96bc-4f4b-8ce9-ad0710f5848f]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8840b1e0-5dda-465f-addb-bf87901f6848]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=889351bc-7326-4f44-aad5-ec5fd45ad099]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29f047e8-c730-4351-bfc6-b52f399dd9ea]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e002650-df1f-49b0-b4f8-896bacb58cc2]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=afc863f4-da62-48fc-b1c6-1adac3a63f11]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=57e94e4b-a570-4da4-8319-8a7c45f0161e]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=39169a1e-dabb-4b55-9c1e-5bbeb5fe214f]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ebd60e4-a682-47ff-b191-4b789adf95f6]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bced4142-2101-4cf4-a128-5880ad0df3cd]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["sso-admin"]: Refreshing state... [id=7573518c-3197-40f0-b553-16d57112c5fc]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=be74f767-aa36-4661-800f-0afc22fe1f44]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["bceid-approver"]: Refreshing state... [id=a6bebcae-5a6a-44f9-8f98-5b2a99d281d0]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3f6f4d94-f380-4493-8bd3-4d6f4a91897e]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fb58d49-7dec-4bfd-95af-ac495e2ce6d8]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16b42c20-54db-4b49-94fb-bce3fd911c16]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f0808d6b-4266-4b88-8f1d-b1015ea17b71]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=77eec50e-f6ca-48cc-8c8d-6efc4a588bb7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03898ff-4879-4215-8a48-14c1a5a1d403]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c0a7a2a-332c-4d7b-82d3-70a8d91c02be]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c0560048-7b7c-4259-8ce3-dfee0d977ce5]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63937871-a3e2-418d-aee6-947ccafeabe2]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3e106a58-cf5c-40bd-b8d8-f6442eddbb6c]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8018b07c-9885-4627-9357-dd02d7942553]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=11f414ef-3e8f-4c2b-8379-4bc85f8d2051]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e556d93f-00bf-43b2-a8ea-4271ceca49ae]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5aa5ebed-497c-42a5-b8be-518ba04f74ca]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d07445e-2736-4131-a023-7d6808d7acff]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=12875dd8-82e1-47df-84a1-2f69914ed41d]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1cd7792c-3529-4f69-830b-34212a44e78b]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e135cdfb-bc4c-4d91-883c-30179ca54ce5]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d20e27a-791e-4ab7-b475-09361cf755a0]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4e00f531-cc58-4fc7-bea9-0412c8ccb812]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c4d99556-9980-49f0-a50d-cac43d51d14a]
module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b5fd07b8-8c7a-4527-b7f6-7e5de02514e6]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=837635b3-fc3a-4442-9148-451f1b74ca55]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=753fae22-08a1-40e1-b798-0594a06fa2ce]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=93ce7085-7fbe-4fed-b401-1660f3de7ab3]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bfab1cc-4a36-47ba-be77-8961227d6ad6]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=be0aa06a-ee89-4e78-adc5-0c8cbb00f12e]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aa6681ca-aa63-4fab-93a4-5297ec667657]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "roadsafety-digital-forms"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "roadsafety-digital-forms"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "roadsafety-digital-forms"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://rsbc-dh-prohibition-web-app-dev.apps.silver.devops.gov.bc.ca/redirect",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "roadsafety-digital-forms"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "roadsafety-digital-forms"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "roadsafety-digital-forms"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://rsbc-dh-prohibition-web-app-test.apps.silver.devops.gov.bc.ca/redirect",
        ]
    }

Plan: 14 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 301 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @jlangy, Action: `pull_request`*